[
    {
        "job_id": "75983432-5697-4351-a065-e05494237222",
        "title": "SIEM/SOAR Sentinel Engineer",
        "employment_type": "Full-time",
        "location": "Washington, District of Columbia, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Bering Straits Native Corporation",
        "salary": "Depends on Experience",
        "skills": "Agile, Azure, Bash, Computer Science, Cyber Security, CyberArk, DHCP, DNS, DevOps, DevSecOps, Google Cloud, Google Cloud Platform, Kanban, LDAP, Linux, MS SQL, MongoDB",
        "location_type": "Hybrid",
        "Job Description": "Bering Global Solutions (BGS) a subsidiary of Bering Straits Native Corporation is currently seeking a qualified SIEM/SOAR MS Sentinel Engineer for a position in Washington DC. This position is remote however, you will be expected to come into the office occasionally.\nIn course of regular job duties, the selected candidate will gain exposure to many different enterprise-grade security technologies, which perform critical functions such as vulnerability scanning, malware detection, network intrusion prevention, firewall blocking, enterprise-wide incident response, and security information and event management (SIEM). Some examples of the 20+ cutting-edge security technologies that the selected candidate will work with are: SentinelOne, Palo Alto firewalls, Microsoft Security Suite, and CyberArk.\nESSENTIAL DUTIES & RESPONSIBILITIES\nThe Essential Duties and Responsibilities are intended to present a descriptive list of the range of duties performed for this position and are not intended to reflect all duties performed within the job. Other duties may be assigned."
    },
    {
        "job_id": "75a9fb3f-929f-4792-acff-1e15001a515a",
        "title": "Cyber Security SOC Manager",
        "employment_type": "Full-time",
        "location": "Washington, District of Columbia, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Bering Straits Native Corporation",
        "salary": "Depends on Experience",
        "skills": ".NET, Active Directory, Agile, Analytical skill, Analytics, ArcSight, CISSP, Certified Ethical Hacker, Cloud computing, Communication, CompTIA, Computer hardware, Computer networking, Cyber security",
        "location_type": "Hybrid",
        "Job Description": "Bering Global Solutions, LLC (BGS) is a recognized leader in providing Technical and Program Management Services, Information Technology, and Logistics Services and Support. BGS is currently seeking a Cyber Security SOC Manager for a project in Washington, DC. The ideal candidate for this job will serve as a lead/manager within the federal client s Security Operations Center. A highly motivated individual with strong technical, communication, and organizational skills will succeed on this program.\n\nThe goal of the Security Operations Center (SOC) team is to proactively monitor, identify, and remediate information technology security vulnerabilities and intrusions. The team lead needs to ensure that all operational security controls are appropriately applied and managed and that systems within the control of the SOC have appropriate security controls in place in accordance with the Federal Information Security Management Act (FISMA). To accomplish this goal, the security team is responsible for a broad suite of security technologies that include vulnerability scanning, malware detection, log file analysis, and enterprise-wide incident response and security information and event management (SIEM) tools. The center lead and their analysts will be responsible for continuous surveillance, analysis, mitigation, remediation, and incident management using the client s current SOC suite of tools."
    },
    {
        "job_id": "31c44983-d5cf-498b-8e46-2d9586d0dc5b",
        "title": "Azure Administrator/Engineer",
        "employment_type": "Full-time",
        "location": "Washington, District of Columbia, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Bering Straits Native Corporation",
        "salary": "Depends on Experience",
        "skills": "ARM, Active Directory, Analytical skill, Backup, Cloud computing, Cloud security, Communication, Computer hardware, Customer relationship management (CRM), Design, Disaster recovery, Documentation",
        "location_type": "Hybrid",
        "Job Description": "Arcticom, a subsidiary of Bering Straits Native Corporation, is currently seeking a qualified Azure Administrator/ Engineer for a contract in Washington D.C.\nThe ideal candidate will coordinate day-to-day operational services supporting cloud server infrastructure, Azure resources, cloud security, facilities, hardware, software, and systems. Direct routine aspects of server Azure administration for IAAS, SAAS, and PAAS solutions; including application design, deployment, monitoring, maintenance, troubleshooting, security, and system documentation.\nThis position is currently remote with some travel to HQ or other sites, if needed.\nESSENTIAL DUTIES & RESPONSIBILITIES\n\nThe Azure Administrator/Engineer must work with the client and team members to ensure the successful completion of the following activities:"
    },
    {
        "job_id": "252da4e6-5795-44f7-bd0d-aebee22cdf96",
        "title": "Network Engineer III",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "SPECTRUM",
        "salary": "USD 78,900.00 - 139,500.00 per year",
        "skills": "Forecasting, Communication, Computer hardware, Problem solving, Documentation, Optimization, Team leadership, Industry-specific, Computer science, Electrical engineering, Telecommunications",
        "location_type": "On Site",
        "Job Description": "This position is eligible for our Hybrid Work Policy. Eligible employees can work from home up to one day each week.\n\nJOB SCOPE\n\nAssists in the planning, forecasting, implementation, and identification of resource requirements for network systems of varying (moderate to high) complexity. Designs and establishes protocol compatibility standards, develops and implements network enhancements and makes recommendations for improvement. Responsible for implementation of network architecture and designs.\n\nDUTIES AND RESPONSIBILITIES\n\nParticipates in network planning, network architecture design and engineering.\nIntegrates and schematically depicts communication architectures, topologies, hardware, software, transmission and signaling links and protocols into complete network configurations.\n\n\n\n\n\n\n\n\n\n\n\nENE311 2024-43178 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-30 08:45 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "91ab1ddc-0989-488a-b37a-17ba72f1caf7",
        "title": "Quality Assurance Engineer",
        "employment_type": "Full-time",
        "location": "Tucson, Arizona, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 95,000.00 - 120,000.00 per year",
        "skills": "Innovation, Process control, Supervision, Technical drafting, Auditing, Reporting, Computer hardware, ROOT, Corrective and preventive action, Regression testing, Acceptance testing",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nWe have an immediate need for a Quality Assurance Engineer in our Tucson facility. We are looking for a dedicated professional who thrives in challenging environments. Our QA department focuses on process controls, metrics measurements, test witnessing, and inspecting & verification of hardware. As the QA engineer, you will be responsible for program and several site level quality assurance functions. This is an exempt, non-supervisory, full-time position.\n\nResponsibilities & Duties\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $95,000 to $120,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: Hardware Test Engineer, Location: Tucson, AZ - 85712"
    },
    {
        "job_id": "efa79da1-770b-4315-974c-a3a19fd59b81",
        "title": "Science/Engineering Aide",
        "employment_type": "Full-time",
        "location": "Los Angeles, California, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 27.00 per hour",
        "skills": "Innovation, Debugging, Writing, Flowchart, Documentation, Program development, Requirements analysis, Systems architecture, Extraction, Sensors, Image processing, Algorithms",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nAt Arete, we are seeking outstanding Scientist/Engineering Aide applicants to closely work with our Scientists/Engineers. The nature of the work is to aid with a variety of programing tasks; provide integration and test support and apply knowledge obtained to solve routine problems. Work will be done on-site. This position is located out of our Northridge, CA office and will begin Summer of 2025.\n\nDuties include, based on internship parameters, but are not limited to generating, revising, updating, compiling, debugging, and writing business, scientific, or software computer programs. Developing flow charts and diagrams outlining process steps in operation; developing and revising program code. You'll prepare documentation of program development, modifications to code and operating instructions. Conducting program tests and may be required to analyze system capabilities to resolve input/output problems.\n\nResearches, designs, develops, and verifies signal and image collection systems, and defines and develops processing and dissemination computer algorithms. Develops requirements analysis, system architecture, and integrates new signal and image capture and processing technology systems. Designs, develops, and analyzes systems for the extraction of information from sensors. Systems utilization includes implementation of signal and image processing with advanced computer architectures.\n\nDesigns, develops, and implements methods, processes, and systems to consolidate and analyze diverse data sets including structured and unstructured. Develops software programs, algorithms, dashboards, information tools, and queries to clean, model, integrate and evaluate datasets. Keeps abreast of new analytic methodologies and technologies. Collaborates with functional business units to drive business solutions and direction.\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: General Engineering Technician, Location: Northridge, CA - 91324"
    },
    {
        "job_id": "1239cd8b-e817-4f7c-b3c0-7197886cd621",
        "title": "Scientist",
        "employment_type": "Full-time",
        "location": "Los Angeles, California, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated 1 hour ago",
        "company_name": "Arete",
        "salary": "USD 90,000.00 - 110,000.00 per year",
        "skills": "Innovation, Science, Machine Learning (ML), Hardware development, Quality assurance, Sensors, Scheduling, Finance, Health insurance, Insurance, Life insurance, Mathematics, Python",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\nDiscover your future with us.\n\nWe are seeking junior and mid-level applicants with a strong Physical Science and/or Applied Math background to work in the areas of ocean remote sensing, signal/image processing and detection, computer vision, machine learning, physics-based modeling, data analysis, sensor hardware development, and field test design and support. As a Scientist tasks include development of physics-based software and algorithms for data analysis. Other duties include but are not limited to work on challenging and important work in the areas of sensor design and analysis; phenomenology exploitation; detection, estimation and tracking algorithms; and target classification and identification. This position is based in our Northridge, CA office. This is an exempt, non-supervisory, full-time position.\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $90,000 to $110,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills.\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: Food Counter Attendant, Location: Northridge, CA - 91324"
    },
    {
        "job_id": "af580089-966a-49ad-a50d-302a19bfd6fc",
        "title": "IT Systems Administrator III",
        "employment_type": "Full-time",
        "location": "Los Angeles, California, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated 1 hour ago",
        "company_name": "Arete",
        "salary": "USD 85,000.00 - 115,000.00 per year",
        "skills": "Reporting, Administrative support, Continuous integration, Information systems, Supervision, IT service management, Network security, Management, LAN, Technical Support, Software licensing",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nAret is seeking an experienced IT Systems Administrator III to work in our Northridge, CA facility. The candidate will report directly to the regional IT Manager and provide support for the day-to-day administrative operations of the IT department. Selected candidates must be eligible to obtain a Top Secret security clearance with SCI access and may be subject to passing a CI Polygraph. The selected candidates will collaborate with other Cyber Security and IT staff members, travel occasionally, and provide some afterhours support. Candidates will also support a variety of information systems at varying levels of complexity on the classified and corporate networks. This is an exempt non-supervisory full-time position.\n\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $85,000 to $115,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: System Administrator, Location: Northridge, CA - 91324"
    },
    {
        "job_id": "ed4f264e-1282-4bb3-8e6a-9fd5d38d68f8",
        "title": "IT Systems Administrator",
        "employment_type": "Full-time",
        "location": "Arlington, Virginia, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 95,000.00 - 125,000.00 per year",
        "skills": "Reporting, Administrative support, Continuous integration, Information systems, Supervision, IT service management, Network security, Management, LAN, Technical Support, Software licensing",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nAret is seeking an experienced IT Systems Administrator to work in our new Falls Church, VA facility. The candidate will report directly to the regional IT Manager and provide support for the day-to-day administrative operations of the IT department. Selected candidates will have and maintain a Top Secret security clearance with SCI access, including a CI Polygraph. The selected candidates will collaborate with other Cyber Security and IT staff members, travel occasionally, and provide some after-hours support. Candidates will also support a variety of information systems at varying levels of complexity on the classified and corporate networks. This is an exempt non-supervisory full-time position.\n\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $95,000 to $125,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: System Administrator, Location: Arlington, VA - 22202"
    },
    {
        "job_id": "ed41cbb7-3bcb-4fcd-bc21-b31ba0e48532",
        "title": "Principal Project Scheduler",
        "employment_type": "Full-time",
        "location": "Tucson, Arizona, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 140,000.00 - 155,000.00 per year",
        "skills": "Innovation, Decision-making, Risk management, Budget, Inventory, Partnership, Supervision, SOW, Work breakdown structure, EVMS, Process engineering, Reporting, SPI, Coaching",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nArete has an immediate opening for a Project Scheduler in the Maritime Systems Business Area. The Project Scheduler will work closely with project managers, technical staff, finance, and others on the team to plan, create, and manage project schedules to enable program decision-making and support delivery of quality products and capabilities to our customer(s). This will include preparation of program plans, risk management, monitoring program execution, reviewing labor and materials costs, operational budgets, and schedules; tracking program deliverables and inventory; and recommending corrective actions such as schedule revisions, manpower adjustments, funding allocations, and work requirements as necessary. In partnership with the Program Finance team, the Project Scheduler will communicate schedule status and performance to the program team. The successful candidate will work in a fast-paced environment and must maintain a high level of accuracy. This is an exempt, non-supervisory, full-time position.\n\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $140,000 to $155,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills.\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: Project Manager, Location: Tucson, AZ - 85712"
    },
    {
        "job_id": "677d6e7a-a977-4f37-9b38-8cd80296929d",
        "title": "Network Engineer IV",
        "employment_type": "Full-time",
        "location": "Englewood, Colorado, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 88,200.00 - 156,600.00 per year",
        "skills": "Wireless communication, Forecasting, Training and development, Customer experience, Management, WAN, High availability, Scalability, Business systems, Modeling, Customer service",
        "location_type": "On Site",
        "Job Description": "This posting has been extended beyond the initial anticipated close date.\n\nSpectrum's Product and Technology team creates, develops, and operates the nation's fastest mobile service, most reliable internet service, most viewed live TV app, and the most advanced WiFi, serving nearly 100 million users and 500 million devices. We are transforming the next era of connectivity and entertainment experiences. The diversity of experience available within Spectrum's Product and Technology team is unmatched and there are opportunities to grow your career as a designer, architect, engineer, developer, operator, or data scientist. We are creative, disciplined, hard-working, complex-problem solvers that believe in collaborating to deliver the highest quality customer experience.\n\nBE PART OF THE CONNECTION\n\nAs a Network Engineer IV, you will lead in the planning, forecasting, implementation, and identification of resource requirements for network systems of high complexity. Design and establish corporate standards, develop and implement network enhancements and make recommendations for improvements. Lead implementation of approved network architecture and designs. Leader in staff development efforts.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nENE312 2024-39285 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2025-01-01 12:00 AM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "65039777-807b-401f-af0b-b24a97120c78",
        "title": "Security Engineer III",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 78,900.00 - 139,500.00 per year",
        "skills": "Database, Network protocols, IT operations, Web applications, Mobile applications, Software development, Cloud computing, Reporting, Operating systems, Firmware, Bash, Python",
        "location_type": "On Site",
        "Job Description": "This position is eligible for our Hybrid Work Policy. Eligible employees can work from home up to one day each week.\n\nJOB SCOPE\nResponsible for conducting penetration testing of information systems, networks, applications, and databases for vulnerabilities and risks within technology environments. Provides simulated cyberattacks and security assessments, under general direction, to probe existing security measures for potential weaknesses and check for exploitable vulnerabilities. Maintains deep knowledge of vulnerabilities and exploits to discern how they affect different systems and network protocols and their communication with each other. Works closely with engineering and technical operations staff to plan, discover, test, and report on penetration testing engagements and identified findings.\n\nDUTIES AND RESPONSIBILITIES\nPerform web application penetration testing, network penetration testing, mobile application penetration testing, and source code reviews.\n\n\n\n\n\n\n\n\nESE340 2024-42240 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-30 07:05 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "29bbb568-01ce-4afa-a409-4ae28905daef",
        "title": "RedHat OpenShift Principal Engineer I",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 110,800.00 - 196,400.00 per year",
        "skills": "Orchestration, Software development, System administration, Red Hat Linux, Technical writing, Customer experience, Wireless communication, Signal processing, Computer hardware, Electrical Systems",
        "location_type": "On Site",
        "Job Description": "This posting has been extended beyond the anticipated close date.\n\nJob Summary\n\nThe Core Wireless Engineering team is looking for an OpenShift Engineer to build systems infrastructure, load application software, and be part of the orchestration solution development effort.\nContribute to the overall system administration functions for the Wireless Core Engienering team\nDevelop the integration strategy for applications into Red Hat OpenShift.\nWrite technical documentation for installation and troubleshooting software.\n\nCompany Overview\n\nSpectrum's Product and Technology team creates, develops, and operates the nation's fastest mobile service, most reliable internet service, most viewed live TV app, and the most advanced WiFi, serving nearly 100 million users and 500 million devices. We are transforming the next era of connectivity and entertainment experiences. The diversity of experience available within Spectrum's Product and Technology team is unmatched and there are opportunities to grow your career as a designer, architect, engineer, developer, operator, or data scientist. We are creative, disciplined, hard-working, complex-problem solvers that believe in collaborating to deliver the highest quality customer experience.\n\n\n\nAs an on the Core Wireless Engineering team, you will be responsible for engineering activities that maintain and enhance the company's telecommunications and signal processing hardware, software and electrical systems. Works with technical operations staff on system design and configuration. Works with design teams and advises team leaders.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEGN601 2024-35832 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-30 12:00 AM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "91deccc0-eb5d-4b09-8ac2-7cae0c4a29e7",
        "title": "Principal Electrical Engineer",
        "employment_type": "Full-time",
        "location": "Los Angeles, California, USA",
        "posted_date": "2024-12-18",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 180,000.00 - 195,000.00 per year",
        "skills": "Innovation, Research, Sonar, Motion control, Functional requirements, Sensors, Computer hardware, Management, Storage, Embedded systems, Power electronics, Testing, System integration",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nAs a Principal Electrical Engineer at Arete, you are responsible for researching, designing, developing, and testing a variety of electronic equipment including advanced imaging systems, LIDAR equipment, SONAR systems, and motion control/pointing solutions. Duties include developing functional requirements and specifications for electronic subsystems to support high bandwidth multi-channel electro-optic sensors and then designing and implementing the hardware to meet those requirements. You will oversee developing and testing control and processing systems utilizing FPGAs, GPUs, computers, and embedded processors. This design will require hands on experience with highspeed data paths using FPGAs, high performance memory and storage subsystems, embedded processors, GPUs, and DSPs. You will develop power electronics using a variety of power modules, integrated circuits, and discrete components to function reliably in harsh environments. You will provide hands on testing, troubleshooting, and system integration of these systems. Having the ability to understand FPGA and microprocessor coding and debugging techniques will help in the system implementation and integration phases of these projects. Other duties include but are not limited to preparing and presenting technical briefings directly to internal and external customers as well as writing and supporting new and existing technical and cost proposals. This position is based out of our office. This position is an exempt non-supervisory full-time position.\n\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\nThe salary range for this role is $180,000 to $195,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills.\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: Electrical Engineer, Location: Northridge, CA - 91324"
    },
    {
        "job_id": "a5988263-8eb3-4f63-96bd-12c602a52326",
        "title": "Vulnerability Analyst",
        "employment_type": "Full-time",
        "location": "Falls Church, Virginia, USA",
        "posted_date": "2024-12-18",
        "modified_date": "- Updated moments ago",
        "company_name": "Arete",
        "salary": "USD 65,000.00 - 90,000.00 per year",
        "skills": "Supervision, Servers, Risk assessment, Risk management, Root cause analysis, Management, Vulnerability management, Policies and Procedures, Finance, Health insurance, Insurance",
        "location_type": "On Site",
        "Job Description": "At Aret, we are on the forefront of utilizing innovative solutions, with great minds from all backgrounds, to help solve the nation's most complex security challenges. We strive for an inclusive, collaborative team environment that approaches differences as opportunities for innovation and excellence. As an employee-owned company, we foster an atmosphere that propels diverse career opportunities and professional growth.\n\nDiscover your future with us.\n\nAret is seeking a full time Vulnerability Analystto work in ourFalls Church, VA facility. The selected candidate must have a active Top-Secret clearance. This individual as part of the Cyber team will provide prioritization to vulnerabilities within the environment, effectively and timely. The candidate will serve as the vulnerability scanning and remediation SME. The candidate may be required to travel occasionally and provide some afterhours support. This is an onsite, exempt, non-supervisory, full-time position.\n\nPrimary responsibilities include:\nWe have an impressive range of benefits, programs, and perks that we offer:\n\n\n\n\n\n\n\n\n\nThe salary range for this role is $65,000 to $90,000; however, Arete considers several factors when extending an offer of employment, including but not limited to: the position and associated responsibilities, a candidate's work experience, education/training, and key skills\n\n\n\nU.S. citizenship is required to meet position eligibility.\n\nSelected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nSuccessful passage of a criminal background screen is required to meet position eligibility. Aret will consider for employment qualified applicants with criminal histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring.\n\nSuccessful passage of a Department of Transportation (DOT) drug test is required to meet position eligibility.\n\n\n\nAret is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex including sexual orientation and gender identity, national origin, disability, protected Veteran Status, or any other characteristic protected by applicable federal, state, or local law.\n\nIf you are a qualified individual with a disability or a disabled veteran, you have the right to request an accommodation if you are unable or limited in your ability to use or access our website because of your disability. To request an accommodation, please contact Aret Human Resources at for assistance.PandoLogic. Keywords: Threat and Vulnerability Analyst, Location: Falls Church, VA - 22042"
    },
    {
        "job_id": "04411005-1025-46aa-8c3b-93da07dd3487",
        "title": "Jurisdictional Consultant II",
        "employment_type": "Full-time",
        "location": "Suisun City, California, USA",
        "posted_date": "2024-12-17",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "FM Global",
        "salary": "USD 77,000.00 - 112,000.00 per year",
        "skills": "Reporting, Intellectual property, Design review, Manufacturing, Inspection, Microsoft Office, Training, PASS, Database, Science, Mechanical engineering, Loss prevention, Communication",
        "location_type": "On Site",
        "Job Description": "FM - San Francisco Operations, is currently accepting applications for a Jurisdictional Consultant in the State of California. This position is primarily responsible for conducting in-service inspections of boilers and pressure vessels in accordance with the applicable jurisdiction. Ideally located in the San Francisco Bay Area.\n\nThe jurisdictional consultant is responsible for their assigned service group (territory). They must be able to do week-long travel with some overnight hotel stays. You must be able to work in confined spaces or at heights with appropriate safety equipment. You will be expected to work independently, must possess a valid driver's license, and will need to work out of your home office.\n\nThe consultant is expected to make intelligent decisions related to travel, work expenses, report timeliness, time management and time reporting, use of company equipment, and our company's and client's intellectual property. The consultant will make sound observations and perform inspections in accordance to the National Board of Boiler and Pressure Vessel Inspector Rules, ASME Code of Construction, and the applicable jurisdictional laws and rules on behalf of FM clients.\n\nInspections are conducted within the requirements of the ASME Boiler and Pressure Vessel Code, the Rules of the National Board of Boiler and Pressure Vessel Inspectors, The National Board Inspection Code, jurisdictional laws and regulations, and FM programs, procedures and instructions. The consultant will be supervised by the Operations Chief Inspector -San Francisco Operations.\n\nIn addition, the consultant performs inspections of varying scope at low to high exposure locations and occupancies to eliminate or mitigate risk factors.\n\nExperience in the Pressure Equipment Industry in one or more of the following:\n\nMicrosoft Office applications experience is also required.\n\nDepending on an individual's experience and other factors, the inspector should have an associate degree from a 2-year technical/vocational school/ or engineering college, or, a high school diploma (GED is acceptable), with a technical working knowledge of boiler and machinery equipment obtained through work experiences.\n\nCandidates who have already obtained a National Board In-Service Commission (IS), and/or state commissions within State of California, are preferred.\n\nCandidates who do not currently possess a National Board In-Service (IS) Commission will be considered. A successful candidate would be expected to complete an assigned training course and successfully pass the National Board IS Commission test within six months of employment.\n\nNational Board \"R\" endorsement is preferred.\n\nKnowledge of Jurisdiction Online database system is a preferred.\n\nBachelor of Science in Engineering with emphasis in Mechanical Engineering is a plus. Additional National Board Endorsements are a plus.\n\nThe candidate shall have a minimum of five (5) credit points based upon the combination of education and experience in the pressure equipment industry and meet the requirements listed for the desired commission. Requirements are listed in the National Board document NB-263, RCI-1 which can be found online.\n\nAs a remote employee, the consultant most be a self-starter, self-motivated with excellent organization skills. The consultant must pay close attention to details, be able to understand and explain boiler and pressure vessel deficiencies and have a strong ability to thoroughly explain loss prevention recommendations to a client. You must have strong organizational, communication, listening and interpersonal skills. Efficient time management, problem solving, and computer skills are a must.\n\nThe consultant, while operating remotely, is expected to be a team player, aiming for successful results for the company, and for the client.\n\nThe salary range for this position is $77,000 to $112,000. The final salary offer will vary based on geographic location, individual education, skills, and experience. The position is eligible to participate in FM's comprehensive Total Rewards program that includes an incentive plan, generous health and well-being programs, a 401(k) and pension plan, career development opportunities, tuition reimbursement, flexible work, time off allowances and much more."
    },
    {
        "job_id": "4cb73f21-43e4-411d-a0c9-1735a1974324",
        "title": "Director of Development, Humanities",
        "employment_type": "Full-time",
        "location": "Los Angeles, California, USA",
        "posted_date": "2024-12-16",
        "modified_date": "- Updated 1 hour ago",
        "company_name": "University of California Los Angeles",
        "salary": "USD 102,500.00 - 125,000.00 per year",
        "skills": "Writing, Unified communications, Fundraising, LOS",
        "location_type": "On Site",
        "Job Description": "Director of Development - Division of Humanities\n\nAt a time when safeguarding and uplifting the humanities is more important than ever - join the UCLA College Development team as the newest Director of Development within the Division of Humanities. You will have an opportunity to engage in purposeful work at a critical moment, on a team that is supportive, collaborative, highly capable and mission driven. The Division of Humanities seeks to inspire ethical and creative solutions to the world's most vexing problems - deeply exploring all aspects of the human condition and recognizing the immense power of language, writing and storytelling to provide meaning and connection across the human experience. As the Director of Development for Humanities you will work closely with a highly diverse population of faculty, students, staff, and donors within departments, programs and centers across the division to close major and transformative gifts while advancing, amplifying and advocating for a division that centers humanity in all that we do. You will join a driven and innovative team dedicated to supporting our students. UCLA is a great place to work filled with many opportunities for professional growth and an excellent benefits package including a pension so you can plan for tomorrow as you advance your career today.\n\nSalary Range: $102,500 - $125,000 Annually\nExplore requisition #5902 and more opportunities via and embark on a rewarding career with UCLA.\n\nUCLA is an Equal Opportunity/Affirmative Action Employer advancing inclusive excellence. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or other protected categories covered by the UC nondiscrimination policy. We are committed to attracting and retaining a diverse workforce along with honoring unique experiences, perspectives, and identities. Together, our community strives to create and maintain working and learning environments that are inclusive, equitable and welcoming.\n\nCopyright 2024 Jobelephant.com Inc. All rights reserved.\n\n\n\njeid-0b2d963dd576f04b9faf1a975afa394e\nPandoLogic. Keywords: Fundraising Director, Location: Los Angeles, CA - 90024"
    },
    {
        "job_id": "bcede073-4df4-4bc2-88a0-c99df06802ec",
        "title": "Software Engineer III - Scala",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-18",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 78,900.00 - 139,500.00 per year",
        "skills": "Wireless communication, Software development, Video, FOCUS, Development testing, Data Analysis, Customer experience, Agile, Scrum, IT security, Test plans, Code coverage, Technical drafting",
        "location_type": "On Site",
        "Job Description": "This posting has been extended beyond it's anticipated closing date.\n\nSpectrum's Product and Technology team creates, develops, and operates the nation's fastest mobile service, most reliable Internet service, most viewed live TV app, and the most advanced WiFi, serving millions of users and devices. We are transforming the next era of connectivity and entertainment experiences. Our goal in the Video Delivery Organization is to help Spectrum succeed by providing services needed to best deliver our video services in support of our business. The Platform Software Development team is responsible for developing various software platforms in support of video delivery, including software for dynamic ad Insertion and subscriber audience targeting. The Scala Software Engineer III will work on the Subscriber Focus application contributing to the maintenance and enhancement of the application, through a multifaceted role involving design, development, testing, data analysis, ETL refinement, and support.\n\nMAJOR DUTIES AND RESPONSIBILITIES\n\nActively and consistently supports all efforts to simplify and enhance the customer experience.\n\nDesign and implement new functionality that is testable and performant with limited oversight and guidance following best practices and approved code patterns\n\nApply object oriented and computer science fundamental principles to coding tasks.\n\nUnderstand and apply different SDLC processes, particularly Agile and Scrum; participate fully in Scrum rituals.\n\nUnderstand and apply applicable technology security and industry regulatory and legal compliance considerations.\n\nIdentify fixes to defects raised.\n\nCreate and execute test plans and ensures code coverage.\n\nRaise defects in code reviews.\n\nProvide an LOE on a project / feature level.\n\nDevelop software independently and write testable and performant code.\n\nContribute to technical requirements and technical design documents.\n\nCollaborate with other team members to identify and solve technical problems.\n\nRespond to customer inquiries around the behavior of the developed software.\n\nDevelop and maintain technical documentation.\n\nEnsure legal, regulatory, process, and security compliance of the code contributed to their application.\n\n\n\n\n\n\n\n\n\n\n\n\n\nESW342 2024-43044 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-23 07:00 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "fb057079-df18-4a45-993d-e9b7663c24a3",
        "title": "Principal Software Engineer I",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-16",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 110,800.00 - 196,400.00 per year",
        "skills": "Wireless communication, .NET, Mentorship, Customer experience, Technical direction, Information architecture, Software architecture, Software design, Automated testing, Analytics",
        "location_type": "On Site",
        "Job Description": "This posting has been extended beyond it's anticipated closing date.\n\nSpectrum's Product and Technology team creates, develops, and operates the nation's fastest mobile service, most reliable internet service, most viewed live TV app, and the most advanced WiFi, serving nearly 100 million users and 500 million devices. We are transforming the next era of connectivity and entertainment experiences. The diversity of experience available within Spectrum's Product and Technology team is unmatched and there are opportunities to grow your career as a designer, architect, engineer, developer, operator, or data scientist. We are creative, disciplined, hard-working, complex-problem solvers that believe in collaborating to deliver the highest quality customer experience.\n\nBE PART OF THE CONNECTION\n\nAs a Principal Software Engineer I on this team, you will lead a high performing front-end engineering team(s) which build innovative customer experiences on the Charter My Spectrum App, the Spectrum.net, SpectrumBusiness.net websites, Charter's next generation products and/or other software systems. This role will work to help the team prioritize, build, and ship the most impactful features to Charter's customers and serve as a mentor to help guide and train other engineers on the team. This position will evaluate the needs, time limitations, and system limitations when developing software. This position must remain up to date on new technologies and software development practices, and is able to translate these skills to their team's deliverables.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nESW610 2024-41931 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-23 05:11 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "69aceeff-56a5-4849-b977-58c41aceb599",
        "title": "System Engineer III - WiFi Operations",
        "employment_type": "Full-time",
        "location": "Greenwood Village, Colorado, USA",
        "posted_date": "2024-12-18",
        "modified_date": "- Updated 2 hours ago",
        "company_name": "SPECTRUM",
        "salary": "USD 78,900.00 - 139,500.00 per year",
        "skills": "Service delivery, NOC, .NET, Product management, FOCUS, ROOT, Tier 2, Tier 3, Root cause analysis, Impact analysis, Knowledge transfer, Collaboration, Documentation",
        "location_type": "On Site",
        "Job Description": "This posting has been extended beyond the initial anticipated closing date\n\nJOB SCOPE\n\nThe Wireless Core Engineer is responsible for monitoring and supporting the service delivery of nationwide WIFI networks while applying a customer-centric approach to troubleshooting and resolving service-impacting issues in a high-performance environment. The Engineer will collaborate with internal and external organizations including Wireless Ops, NOC, Net Ops, Field Ops, Engineering, Product management, and 3rd parties to deliver a best-in-class Wireless Network experience for our customers.\n\nDUTIES AND RESPONSIBILITIES\nFocus on customer's wireless service experience and improving network performance.\nVigorously pursue high standards of wireless network performance and availability.\n\n\n\n\n\n\n\n\n#LI-MA\n\nISY350-NTO 2024-40596 2024\n\nHere, employees don't just have jobs, they build careers. That's why we believe in offering a comprehensive package that rewards employees for their contributions to our success, supports all aspects of their well-being, and delivers real value at every stage of life.\n\nA qualified applicant's criminal history, if any, will be considered in a manner consistent with applicable laws, including local ordinances.\n\nThis job posting will remain open until 2024-12-23 07:00 PM (UTC) and will be extended if necessary.\n\nThe base pay for this position generally is between . The actual compensation offered will carefully consider a wide range of factors, including your skills, qualifications, experience, and location. We comply with local wage minimums and also, certain positions are eligible for additional forms of other incentive-based compensation such as bonuses.\n\nCharter Communications is known in the United States by our Spectrum brands, including: Spectrum Internet , TV, Mobile and Voice, Spectrum Networks, Spectrum Enterprise and Spectrum Reach. When you join us, you're joining a strong community of more than 100,000 individuals working together to serve nearly 32 million customers in 41 states and keep them connected to what matters most.\nWe're committed to growing a workforce that reflects our communities, and providing equal opportunities for employment and advancement. EOE, including disability/vets."
    },
    {
        "job_id": "13281a19-9c4e-4296-b912-7190a1978ff8",
        "title": "Transportation Technical Design Manager",
        "employment_type": "Full-time",
        "location": "Charlotte, North Carolina, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "GPI",
        "salary": "N/A",
        "skills": "Technical drafting, Estimating, Management, Collaboration, Civil engineering, AutoCAD, MicroStation, Reporting, English, Editing, Microsoft Word, Microsoft Excel, Microsoft Outlook",
        "location_type": "On Site",
        "Job Description": "Description\n\nGPIseeks a Transportation Technical Design Lead with a Highway, Bridge, or Traffic engineering background to join our growing North Carolina practice. This position can work out of our Raleigh or Charlotte, NC, office. As the successful candidate, you will have the opportunity to work in and grow our transportation department.\n\nDo you value a company that puts employee satisfaction and diversity at the forefront of who they are? If so,GPIwants you!\n\nGPIis a multi-discipline engineering firm providing planning, design, and construction services for transportation infrastructure and building system projects throughout the United States for over 50 years. Ranked in the Top 100 Firms by Engineering News Record, GPI is a forward-thinking, innovative firm with a culture committed to excellence and fosters staff empowerment. For more information, visit:;br>\nResponsibilities:\n\n#Pando\n\n\n\n\n\n\noffers excellent benefits, including a 401(k) plan, ESOP, medical/dental/vision plans, paid time off, and more. GPI is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, national origin, disability, or protected veteran status. M/F/D/V\n\n\n\nGPI does not accept unsolicited resumes from recruiters and/or agencies. Any staffing/employment agency, person, or entity that submits an unsolicited resume to this site does so with the understanding that the applicant's resume will become the property of GPI and has the right to hire that applicant at its discretion and without any fee owed to the submitting staffing/employment agency, person or entity.\n\nGPI will not pay a placement fee unless the agency or recruiter has a signed contract with GPI's Corporate Human Resources department in advance of submitting a candidate for consideration. Staffing/employment agencies must submit applicants to the designated GPI recruiter to be eligible for a placement fee. Verbal and written approvals will not be considered a valid contract for service.\n\n\n\nVerification of employment eligibility will be required at the time of hire. Visa sponsorship is typically not available for entry-level positions. GPI participates in E-Verify. Know your Right to Work.PandoLogic. Keywords: Transportation Manager, Location: Charlotte, NC - 28254"
    },
    {
        "job_id": "4f7a7c9e-e1d9-4807-ad4b-68bed0df2336",
        "title": "Principal Engineer, Reagent Engineering",
        "employment_type": "Full-time",
        "location": "Hazelwood, Missouri, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "bioMerieux",
        "salary": "N/A",
        "skills": "Medical devices, Change control, Regulatory Compliance, Documentation, Purchasing, Capital expenditures, Engineering support, Management, Process improvement, Continuous improvement",
        "location_type": "On Site",
        "Job Description": "Position Summary & Responsibilities:\n\nThe Principal Engineer, Reagent Engineering will work within the Reagent Engineering Equipment Project team. This team is responsible for the manufacturing equipment used to produce a complex medical device and provides project management and technical expertise related to the manufacturing equipment.\nMain accountabilities are to lead and manage equipment related projects and to provide Solidworks / AutoCAD expertise related to equipment design / modification.\nAct as administrator for Solidworks PDM system.\nDevelop documentation such as equipment master records, equipment drawings, parts lists, etc. as required.\nManage change control process and other compliance related documentation for projects.\nCollaborate with Manufacturing, Purchasing, and Quality to lead projects and ensure the optimum manufacturing process in terms of keeping manufacturing moving.\n\n\n\n\nPandoLogic. , Location: Hazelwood, MO - 63042"
    },
    {
        "job_id": "08032a31-418c-47b0-b36c-6a4fd5adcd3b",
        "title": "Maintenance and HVAC Specialist",
        "employment_type": "Full-time",
        "location": "Columbus, Ohio, USA",
        "posted_date": "2024-12-21",
        "modified_date": "- Updated moments ago",
        "company_name": "Harrison on 5th by Senior Star Management Company",
        "salary": "N/A",
        "skills": "Teamwork, Collaboration, Attention to detail, Positive attitude, Preventive maintenance, Electrical engineering, SAFE, Organized, Workflow, Scheduling, Oracle Linux, Microsoft Excel",
        "location_type": "On Site",
        "Job Description": "Join Our Team: Maintenance and HVAC Specialist\n\nAt Senior Star, we take pride in creating a beautiful and safe environment for our residents and associates. We're looking for a dedicated Maintenance and HVAC Specialist who values teamwork, enjoys serving those in their retirement years, and is passionate about making a difference.\n\nWhat We're Looking For:\nHVAC Certification is required.\nAt least 5 years of professional maintenance experience, including HVAC, electrical, plumbing, and general maintenance.\nAbility to work independently and efficiently with attention to detail.\nA positive attitude and a genuine desire to serve others.\n\n\n\n\n\n\n\nIf you're passionate about maintaining beautiful spaces, have the qualifications to excel, and want to make a difference in the lives of others, we'd love to meet you. Apply today and join the family!\n\n\n\n#INDHFA\nPandoLogic. Keywords: HVAC Technician, Location: Columbus, OH - 43201"
    }
]